<a href="https://colab.research.google.com/github/HaseenaB/python-coding/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np

In [0]:
import pandas as pd

In [0]:
x=pd.Series([1,2,3])

In [0]:
x

0    1
1    2
2    3
dtype: int64

In [0]:
y=pd.Series([4,5,6])

In [0]:
y

0    4
1    5
2    6
dtype: int64

In [0]:
z=pd.DataFrame({"x":x,"y":y})

In [0]:
z

   x  y
0  1  4
1  2  5
2  3  6

In [0]:
a=pd.Series([1,3,4,5,6])

In [0]:
a

0    1
1    3
2    4
3    5
4    6
dtype: int64

In [0]:
a[0]="Haseena"

In [0]:
a

0    Haseena
1          3
2          4
3          5
4          6
dtype: object

In [0]:
b=pd.DataFrame({"Name":["Haseena","Sarama","Thabeena","Thariq","Shindu","Arjun","ManiJ","ManiS"],"Age":[27,22,2,33,21,22,23,22],"City":["Salem","Vijayawada","Salem","Dadagapatty","Erode","Dindal","Omalulr","Deevatipatty,"]})

In [0]:
b[["Name","Age","City"]]

       Name  Age           City
0   Haseena   27          Salem
1    Sarama   22     Vijayawada
2  Thabeena    2          Salem
3    Thariq   33    Dadagapatty
4    Shindu   21          Erode
5     Arjun   22         Dindal
6     ManiJ   23        Omalulr
7     ManiS   22  Deevatipatty,

In [0]:
b.iloc[0:5]

   Age         City      Name
0   27        Salem   Haseena
1   22   Vijayawada    Sarama
2    2        Salem  Thabeena
3   33  Dadagapatty    Thariq
4   21        Erode    Shindu

In [0]:
d=pd.Series([21,22,23,24,25,26,27,28])

In [0]:
height=d

In [0]:
height

0    21
1    22
2    23
3    24
4    25
5    26
6    27
7    28
dtype: int64

In [0]:
data

         A   d
0  Haseena  21
1        3  22
2        4  23
3        5  24
4        6  25
5      NaN  26
6      NaN  27
7      NaN  28

In [0]:
c=pd.DataFrame({"Height":[i for i in range(100,108)]})

In [0]:
c

   Height
0     100
1     101
2     102
3     103
4     104
5     105
6     106
7     107

In [0]:
data=pd.DataFrame(["b":b,"c":c])

SyntaxError: ignored